---
kind: type
id: T:Autodesk.Revit.DB.CurveByPointsUtils
source: html/20dd9f72-4653-4ea8-6397-af04e5093fbe.htm
---
# Autodesk.Revit.DB.CurveByPointsUtils

A static class that contains methods for processing curves driven by points.

## Syntax (C#)
```csharp
public class CurveByPointsUtils : IDisposable
```